In [19]:
#series
import numpy as np
import pandas as pd
#create a series from list
data = [1,2,3,4,5]
series = pd.Series(data)
series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
series.dtype

dtype('int64')

In [6]:
type(series)

pandas.core.series.Series

In [7]:
#create a series from dict
data = {'a':1,'b':2,'c':3}
data

{'a': 1, 'b': 2, 'c': 3}

In [8]:
pd.Series(data)

a    1
b    2
c    3
dtype: int64

In [11]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [15]:
##DataFrame
#create a datafrmae from dict of list
data ={'name':['yesh','teja','vera'],
      'age':[10,20,30],
      'city':['hyd','che','bglr']}
df = pd.DataFrame(data)
df

   name  age  city
0  yesh   10   hyd
1  teja   20   che
2  vera   30  bglr

In [16]:
type(df)

pandas.core.frame.DataFrame

In [20]:
np.array(df)

array([['yesh', 10, 'hyd'],
       ['teja', 20, 'che'],
       ['vera', 30, 'bglr']], dtype=object)

In [23]:
#create a dataframe from a list of dictionaries
data = [{'name':'yesh','age':10,'city':'hyd'},
        {'name':'teja','age':20,'city':'che'},
        {'name':'vera','age':30,'city':'del'},
       ]
df=pd.DataFrame(data)

In [24]:
df

   name  age city
0  yesh   10  hyd
1  teja   20  che
2  vera   30  del

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df=pd.read_csv("case_id.csv")

In [27]:
df

       Unnamed: 0    case_id  count
0               0     EZYV01      1
1               1  EZYV16995      1
2               2  EZYV16993      1
3               3  EZYV16992      1
4               4  EZYV16991      1
...           ...        ...    ...
25475       25475   EZYV8492      1
25476       25476   EZYV8491      1
25477       25477   EZYV8490      1
25478       25478   EZYV8489      1
25479       25479  EZYV25480      1

[25480 rows x 3 columns]

In [28]:
df.head()

   Unnamed: 0    case_id  count
0           0     EZYV01      1
1           1  EZYV16995      1
2           2  EZYV16993      1
3           3  EZYV16992      1
4           4  EZYV16991      1

In [29]:
df.tail()

       Unnamed: 0    case_id  count
25475       25475   EZYV8492      1
25476       25476   EZYV8491      1
25477       25477   EZYV8490      1
25478       25478   EZYV8489      1
25479       25479  EZYV25480      1

In [30]:
df['case_id']

0           EZYV01
1        EZYV16995
2        EZYV16993
3        EZYV16992
4        EZYV16991
           ...
25475     EZYV8492
25476     EZYV8491
25477     EZYV8490
25478     EZYV8489
25479    EZYV25480
Name: case_id, Length: 25480, dtype: object

In [31]:
type(df['case_id'])

pandas.core.series.Series

In [34]:
df.loc[0]

Unnamed: 0         0
case_id       EZYV01
count              1
Name: 0, dtype: object

In [37]:
df.iloc[0:]

       Unnamed: 0    case_id  count
0               0     EZYV01      1
1               1  EZYV16995      1
2               2  EZYV16993      1
3               3  EZYV16992      1
4               4  EZYV16991      1
...           ...        ...    ...
25475       25475   EZYV8492      1
25476       25476   EZYV8491      1
25477       25477   EZYV8490      1
25478       25478   EZYV8489      1
25479       25479  EZYV25480      1

[25480 rows x 3 columns]

In [38]:
df['case_id']

0           EZYV01
1        EZYV16995
2        EZYV16993
3        EZYV16992
4        EZYV16991
           ...
25475     EZYV8492
25476     EZYV8491
25477     EZYV8490
25478     EZYV8489
25479    EZYV25480
Name: case_id, Length: 25480, dtype: object

In [39]:
df.at[1,'case_id']

'EZYV16995'

In [40]:
data ={'name':['yesh','teja','vera'],
      'age':[10,20,30],
      'city':['hyd','che','bglr']}
df = pd.DataFrame(data)
df

   name  age  city
0  yesh   10   hyd
1  teja   20   che
2  vera   30  bglr

In [43]:
df.loc[1,'name']

'teja'

In [44]:
df.at[1,'age']

20

In [45]:
df.at[2,'age']

30

In [46]:
df.at[0,'age']

10

In [47]:
df.iat[2,2]

'bglr'

In [49]:
df['salary']=[100,200,300]

In [50]:
df

   name  age  city  salary
0  yesh   10   hyd     100
1  teja   20   che     200
2  vera   30  bglr     300

In [56]:
df.drop('salary',axis=1,inplace=True)

In [57]:
df

   name  age  city
0  yesh   10   hyd
1  teja   20   che
2  vera   30  bglr

In [60]:
df['age']=df['age']+1

In [61]:
df

   name  age  city
0  yesh   11   hyd
1  teja   21   che
2  vera   31  bglr

In [62]:
df.dtypes

name    object
age      int64
city    object
dtype: object

In [64]:
df.describe()

        age
count   3.0
mean   21.0
std    10.0
min    11.0
25%    16.0
50%    21.0
75%    26.0
max    31.0